import { Component, CUSTOM_ELEMENTS_SCHEMA } from '@angular/core';
import { CommonModule, NgOptimizedImage } from '@angular/common';

@Component({
  selector: 'app-how-to-install',
  standalone: true,
  imports: [CommonModule, NgOptimizedImage],
  templateUrl: './how-to-install.component.html',
  styleUrl: './how-to-install.component.css',
  schemas: [CUSTOM_ELEMENTS_SCHEMA],
})
export class HowToInstallComponent {
  steps: {
    id: number;
    content: string;
    imageUrl: string;
  }[] = [
    {
      id: 1,
      content: `أولاً، عليك أن تقرر عدد الكاميرات التي تحتاجها والمكان الذي تريد وضعها فيها. يجب عليك تغطية المناطق الأكثر عرضة للخطر في الممتلكات الخاصة بك، مثل الباب الأمامي، والباب الخلفي، والنوافذ، والمرآب، وما إلى ذلك. يمكنك أيضًا استخدام جرس باب فيديو لبابك الأمامي، والذي يمكن أن ينبهك عندما يقترب شخص ما من الجرس أو يقرعه. يمكنك أيضًا استخدام الكاميرات الداخلية لمراقبة غرف أو مناطق معينة داخل منزلك.`,
      imageUrl: 'assets/images/how_to_install/1.png',
    },
    {
      id: 2,
      content: `ثانياً، عليك اختيار نوع الكاميرات والنظام الذي تريده. هناك خيارات سلكية ولاسلكية، بالإضافة إلى خيارات تناظرية ورقمية. تتطلب الكاميرات السلكية توصيل كابلات من كل كاميرا إلى جهاز DVR مركزي (مسجل فيديو رقمي) أو صندوق NVR (مسجل فيديو شبكي)، والذي يقوم بتخزين اللقطات ويسمح لك بالوصول إليها عن بعد. تستخدم الكاميرات اللاسلكية إشارات Wi-Fi أو الإشارات الخلوية لنقل اللقطات إلى خدمة سحابية أو جهاز تخزين محلي. تستخدم الكاميرات التناظرية كبلات BNC وبالونات (محولات تحول الإشارات التناظرية إلى إشارات رقمية) للاتصال بصندوق DVR. تستخدم الكاميرات الرقمية كابلات إيثرنت أو شبكة Wi-Fi للاتصال بصندوق NVR أو الخدمة السحابية.`,
      imageUrl: 'assets/images/how_to_install/2.png',
    },
    {
      id: 3,
      content: `ثالثا، تحتاج إلى إعداد تركيب الكاميرا. يجب عليك تخطيط مسار الكابلات (في حالة استخدام الكاميرات السلكية) والتأكد من أن لديك ما يكفي من الطول والموصلات لكل كاميرا. يجب عليك أيضًا التحقق من مصدر الطاقة واتصال الإنترنت لكل كاميرا. قد تحتاج إلى حفر ثقوب في الجدران أو الأسقف لتشغيل الكابلات أو تركيب الكاميرات. يجب عليك أيضًا تحديد المنطقة التي تريد تركيب كل كاميرا فيها بقلم رصاص وحفر الثقوب مسبقًا إذا لزم الأمر.`,
      imageUrl: 'assets/images/how_to_install/3.png',
    },
    {
      id: 4,
      content: `رابعا، تحتاج إلى تركيب الكاميرات وتوصيلها بجهاز DVR أو NVR (في حالة استخدام الكاميرات السلكية) أو بشبكة Wi-Fi الخاصة بك (في حالة استخدام الكاميرات اللاسلكية). يجب عليك اتباع التعليمات المرفقة مع نظام الكاميرا الخاص بك واستخدام دعامات التثبيت والمسامير المتوفرة. يجب عليك أيضًا ضبط زاوية وموضع كل كاميرا للحصول على أفضل عرض للمنطقة التي تريد مراقبتها. يجب عليك أيضًا اختبار كل كاميرا للتأكد من أنها تعمل بشكل صحيح وترسل صورًا وصوتًا واضحًا.`,
      imageUrl: 'assets/images/how_to_install/4.png',
    },
    {
      id: 5,
      content: `خامسًا، تحتاج إلى إعداد واجهة المستخدم لنظام الكاميرا الخاص بك. يجب عليك توصيل جهاز DVR أو NVR الخاص بك بالشاشة والماوس ولوحة المفاتيح، أو استخدام تطبيق الهاتف الذكي أو متصفح الويب للوصول إلى نظام الكاميرا الخاص بك عن بعد. يجب عليك اتباع الإرشادات التي تأتي مع نظام الكاميرا الخاص بك وإعداد حسابك وكلمة المرور وإعدادات الشبكة وإعدادات التسجيل وإعدادات اكتشاف الحركة وإعدادات التنبيهات وما إلى ذلك. ويجب عليك أيضًا مراجعة لقطاتك بانتظام وحذف أي ملفات غير ضرورية لإخلاء مساحة.`,
      imageUrl: 'assets/images/how_to_install/5.png',
    },
  ];
}
