import { Component } from '@angular/core';
import { CommonModule, NgOptimizedImage } from '@angular/common';

@Component({
  selector: 'app-privacy-policy',
  standalone: true,
  imports: [CommonModule, NgOptimizedImage],
  templateUrl: './privacy-policy.component.html',
  styleUrl: './privacy-policy.component.css',
})
export class PrivacyPolicyComponent {
  information: {
    id: number;
    icon: string;
    title: string;
    desciption: string;
  }[] = [
    {
      id: 1,
      icon: 'assets/images/privacy_policy/info_1.png',
      title: `المعلومات الشخصية`,
      desciption: ` تتضمن اسمك وعنوان بريدك الإلكتروني ورقم هاتفك وأي معلومات أخرى تقدمها لنا طوعًا عند الاتصال بنا أو تسجيل حساب أو تقديم طلب أو الاشتراك في نشرتنا الإخبارية.`,
    },
    {
      id: 2,
      icon: 'assets/images/privacy_policy/info_2.png',
      title: `المعلومات الفنية`,
      desciption: `تتضمن عنوان IP الخاص بك، ونوع المتصفح، ونوع الجهاز، ونظام التشغيل، وغيرها من المعلومات التي نجمعها تلقائيًا عند وصولك إلى موقعنا على الويب من خلال ملفات تعريف الارتباط أو تقنيات التتبع الأخرى.`,
    },
    {
      id: 3,
      icon: 'assets/images/privacy_policy/info_3.png',
      title: `الاستخدام`,
      desciption: `تتضمن سجل التصفح الخاص بك واستعلامات البحث والتفضيلات والمعلومات الأخرى التي نجمعها عندما تتفاعل مع موقعنا الإلكتروني أو منتجاتنا وخدماتنا.`,
    },
  ];

  policies = [
    {
      id: 1,
      icon: 'assets/images/privacy_policy/1.png',
      title: `كيف نستعمل معلوماتك؟`,
      description: `قد نستخدم معلوماتك للأغراض التالية:`,
      points: [
        `لتزويدك بمنتجاتنا وخدماتنا ومعالجة طلباتك وتوصيل منتجاتك والتواصل معك بشأن طلباتك ومعاملاتك.`,
        `لتحسين موقعنا ومنتجاتنا وخدماتنا، وتخصيص تجربتك على موقعنا وفقًا لاهتماماتك وتفضيلاتك.`,
        `لإرسال رسائل البريد الإلكتروني التسويقية والترويجية والنشرات الإخبارية وغيرها من وسائل الاتصال إليك حول منتجاتنا وخدماتنا وعروضنا وأحداثنا، إذا كنت قد وافقت على استلامها.`,
        `للرد على استفساراتكم أو ملاحظاتكم أو شكاويكم أو طلبات الدعم.`,
        `لحماية موقعنا الإلكتروني ومنتجاتنا وخدماتنا، ولمنع وكشف والتحقيق في الاحتيال أو الخروقات الأمنية أو غيرها من الأنشطة غير القانونية أو غير المصرح بها.`,
        `للامتثال لالتزاماتنا القانونية، وإنفاذ الشروط والأحكام الخاصة بنا، وحماية حقوقنا ومصالحنا.`,
      ],
    },
    {
      id: 2,
      icon: 'assets/images/privacy_policy/2.png',
      title: `كيف نشارك معلوماتك؟`,
      description: `قد نشارك معلوماتك مع الأطراف التالية:`,
      points: [
        `مقدمو الخدمات: هذه شركات خارجية تساعدنا في عملياتنا التجارية، مثل الاستضافة ومعالجة الدفع والتسليم والتحليلات والتسويق وخدمة العملاء. نحن نشارك معلوماتك فقط مع مقدمي الخدمات الذين نثق بهم والذين وافقوا على حماية معلوماتك وفقًا لهذه السياسة والقوانين المعمول بها.`,
        `الشركات التابعة: هذه هي الشركات التابعة لنا أو الشركات الأم أو غيرها من الكيانات ذات الصلة التي تخضع لسيطرة مشتركة معنا. قد نشارك معلوماتك مع الشركات التابعة لنا لأغراض تجارية داخلية، مثل الإدارة والتنظيم وتطوير المنتجات.`,
        `شركاء العمل: هم شركات خارجية نتعاون معها لنقدم لك منتجات أو خدمات أو عروض ترويجية قد تهمك. لا يجوز لنا مشاركة معلوماتك مع شركائنا التجاريين إلا إذا وافقت على تلقي مثل هذه الاتصالات منهم أو منا.`,
        `جهات إنفاذ القانون والجهات التنظيمية: هذه هي السلطات الحكومية أو الكيانات الأخرى التي لديها القدرة على طلب أو إجبارنا على الكشف عن معلوماتك لأغراض قانونية أو تنظيمية. يجوز لنا مشاركة معلوماتك مع جهات إنفاذ القانون والجهات التنظيمية إذا اعتقدنا أن ذلك ضروري أو مناسب للقيام بذلك، أو إذا طلب منا ذلك بموجب القانون.`,
      ],
    },
    {
      id: 3,
      icon: 'assets/images/privacy_policy/3.png',
      title: `كيف نحمي معلوماتك؟`,
      description: ``,
      points: [
        `نحن نتخذ تدابير معقولة لحماية معلوماتك من الوصول أو الاستخدام أو الكشف أو التغيير أو التدمير غير المصرح به. نحن نستخدم وسائل حماية فنية وإدارية ومادية، مثل التشفير وجدران الحماية وكلمات المرور وأدوات التحكم في الوصول، لتأمين معلوماتك. ومع ذلك، لا يمكننا ضمان أن معلوماتك آمنة تمامًا من المتسللين أو الهجمات الإلكترونية أو التهديدات الأخرى، وأنك تستخدم موقعنا الإلكتروني ومنتجاتنا وخدماتنا على مسؤوليتك الخاصة.`,
      ],
    },
    {
      id: 4,
      icon: 'assets/images/privacy_policy/4.png',
      title: `كيف نستخدم ملفات تعريف الارتباط وتقنيات التتبع الأخرى؟`,
      description: ``,
      points: [
        `نحن نستخدم ملفات تعريف الارتباط وتقنيات التتبع الأخرى، مثل إشارات الويب والبكسل والعلامات، لجمع وتخزين المعلومات حول زيارتك واستخدامك لموقعنا الإلكتروني ومنتجاتنا وخدماتنا. ملفات تعريف الارتباط هي ملفات نصية صغيرة يتم وضعها على متصفحك أو جهازك بواسطة مواقع الويب التي تزورها. إنها تساعدنا على تذكر تفضيلاتك، وتعزيز تجربة المستخدم الخاصة بك، وقياس وتحليل أداء موقعنا على الويب، وتقديم الإعلانات ذات الصلة لك.`,
      ],
    },
    {
      id: 5,
      icon: 'assets/images/privacy_policy/5.png',
      title: `كيف نقوم بتحديث هذه السياسة؟`,
      description: ``,
      points: [
        `قد نقوم بتحديث هذه السياسة من وقت لآخر لتعكس التغييرات في ممارساتنا أو تقنياتنا أو متطلباتنا القانونية. سنقوم بإخطارك بأي تغييرات جوهرية عن طريق نشر إشعار على موقعنا، أو عن طريق إرسال بريد إلكتروني إليك، إذا كانت لدينا تفاصيل الاتصال الخاصة بك. سيتم الإشارة إلى تاريخ آخر تحديث في أعلى هذه السياسة. نحن نشجعك على مراجعة هذه السياسة بشكل دوري لتبقى على علم بكيفية تعاملنا مع معلوماتك.`,
      ],
    },
  ];
}
